WcfMovieService/Examples/Gladiator.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/" xmlns:wcf="http://schemas.datacontract.org/2004/07/WcfMovieService">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:AddMovie>
         <tem:movie>
            <wcf:Code>MDE7531598</wcf:Code>
            <wcf:Director>Ridley Scott</wcf:Director>
            <wcf:Id>0</wcf:Id>
            <wcf:Title>Gladiator</wcf:Title>
            <wcf:Year>2000</wcf:Year>
         </tem:movie>
      </tem:AddMovie>
   </soapenv:Body>
</soapenv:Envelope>